//=============================================================================
//
// バレット着地点カーソル処理 [bulletpoint.h]
// Author : 木村純(キムラジュン)
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXMATRIX mtxWorld;	// ワールドマトリックス
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 scl;		// スケール
	float fWidth;			// 幅
	float fHeight;			// 高さ
	int nIdxShadow;			// 影ID
	bool bUse;				// 使用しているかどうか
} BULLETPOINT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBulletPoint(void);
void UninitBulletPoint(void);
void UpdateBulletPoint(void);
void DrawBulletPoint(int type);
void SetBulletPoint(D3DXVECTOR3 pos, float fWidth, float fHeight, int type);

BULLETPOINT *GetBulletPoint(void);

