//=============================================================================
//
// カメラ処理 [camera.h]
// Author : 木村純(キムラジュン)
//
//=============================================================================
#pragma once


//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <d3dx9.h>

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	POS_H_CAM		(80.0f)		// カメラの位置高さ(プレイヤーからみて+150)
#define	POS_W_CAM		(-150.0f)		// カメラの位置横幅(プレイヤーからみて-100)

#define	AT_H_CAM		(0.0f)			// カメラの注視点高さ(プレイヤーからみて+0)
#define	AT_W_CAM		(300.0f)		// カメラの注視点横幅(プレイヤーからみて+200)

struct CAMERA
{
	D3DXVECTOR3			pos;			// カメラの視点(位置)
	D3DXVECTOR3			at;				// カメラの注視点
	D3DXVECTOR3			up;				// カメラの上方向ベクトル
	D3DXVECTOR3			rot;			// カメラの回転
	float				len;			// カメラの視点と注視点の距離
	D3DXMATRIX			mtxView;		// ビューマトリックス
	D3DXMATRIX			mtxProjection;	// プロジェクションマトリックス

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitCamera(void);
void UninitCamera(void);
void UpdateCamera(void);
void SetCamera(int CamNum);
CAMERA *GetCamera();
