//=============================================================================
//
// ライフ処理 [life.h]
// Author : 木村純(キムラジュン)
//
//=============================================================================
#pragma once


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLifeTex(int type);
void UninitLifeTex(void);
void UpdateLifeTex(void);
void DrawLifeTex(void);

void ChangeLife(int value, int type);

